{"review": [{"review_comment": "SAP Is a quite straight forward company that knows what it is doing and designs software around what you REALLY need and nothing more or less.  This means as an employee you are under the scrutiny of the employer on how much it wanted to spend on SAP. My SAP programs for example don't have mouse support which seems bizarre.  But others do have mouse support and are far more user friendly.", "review_date": "Friday, August 16, 2013", "review_name": "EcueD"}, {"review_comment": "I have maximized efficiency using SAP software which has led to a direct increase to profits for my business.  I was able to manage the whole process with complete confidence in Security as well.  SAP stands by their Software and offers full tech support  should any questions arise.   The whole experience had been positive from day one and I will continue to use their Products and Services and look forward to many more prosperous years! ", "review_date": "Friday, August 16, 2013", "review_name": "Joe Gresham"}, {"review_comment": "I love SAP - I would highly recommend this program, since it's the best of its kind on the market. This is easily a 5-star product.", "review_date": "Monday, July 29, 2013", "review_name": "Steven"}, {"review_comment": "SAP compares to no other! I am completely organized now and life is much simpler. Thank you so much for a wonderful product!", "review_date": "Monday, July 15, 2013", "review_name": "Rain Bright"}, {"review_comment": "I have used other products that are available but was always coming away disappointed. SAP has been the only product I have found that meets all my needs. Now its the only thing I use.", "review_date": "Monday, June 24, 2013", "review_name": "John H"}, {"review_comment": "SAP is top notch. Possibly the best program of its kind and exactly what I was looking for! A  product", "review_date": "Tuesday, May 21, 2013", "review_name": "Steve Rhodes"}, {"review_comment": "I had been looking for a software to help my business with finances and SAP has given our office everything we've been looking for.", "review_date": "Wednesday, April 3, 2013", "review_name": "Tim Fester"}, {"review_comment": "SAP is a wonderful software that has allowed me to manage my business, both effectively and efficiently. The software allows for a management of relations between both business operations and our clientele.  ", "review_date": "Tuesday, April 2, 2013", "review_name": "Ronald"}, {"review_comment": "Excellently performed every task I had even hoped to be accomplished. Simply one of the best available and well worth every bit of time and money. By far one of the most efficient I've ever seen. ", "review_date": "Monday, March 25, 2013", "review_name": "Dwight Westercamp"}, {"review_comment": "One of the best products on the market today. Super easy to use and beats what we had before. Great price too.", "review_date": "Thursday, March 14, 2013", "review_name": "Bob Loblaw"}, {"review_comment": "If you are looking for something that can be used on the go to achieve your needs, SAP is the right choice.  With data that is not meant for the open market high levels of security are needed, and being able to trust this data on the mobile market is a game changer.", "review_date": "Wednesday, March 6, 2013", "review_name": "Chris"}, {"review_comment": "I can't recommend SAP highly enough! Their SME enabled my business to focus on our workflow, and would be a great addition to any company, large or small! ", "review_date": "Monday, February 25, 2013", "review_name": "J.G. Oebbels"}, {"review_comment": "Wonderful! Love this app for my website/business! I would definitely recommend it to others, app is easy to use.", "review_date": "Tuesday, February 12, 2013", "review_name": "Lashonda"}, {"review_comment": "SAP has helped me connect with my customers who visit my site in ways I would never have imagined! Since signing up with them, I have a strong relationship with my customers and I know how to keep them happy, thank you SAP! ", "review_date": "Monday, February 11, 2013", "review_name": "anna"}, {"review_comment": "SAP has great secure mobile access. If you are a small or large business I strongly suggest SAP to you! It has helped my business tremendously. ", "review_date": "Friday, February 1, 2013", "review_name": "zak"}, {"review_comment": "I have been very impressed with SAP. They are exactly what my business needs. Well-done on all accounts! Could not more highly recommend this business.", "review_date": "Monday, January 28, 2013", "review_name": "Michael Stevens"}, {"review_comment": "SAP has secure mobile access, which I have to have and it's simple. I have Business applications that work with my existing infrastructure, pre-packaged software that is easy installation and it helps me cut costs. Cloud usage is also a plus and a must.  A  for this company, thank you!. ", "review_date": "Tuesday, January 22, 2013", "review_name": "CJ"}, {"review_comment": "SAP software allows almost unlimited capabilities for streamlining business technologies. Their analytics services are simply cutting edge.  Highly recommended for all but the smallest of companies. ", "review_date": "Tuesday, January 15, 2013", "review_name": "Dennis"}, {"review_comment": "SAP is a great company that can help you make better decisions for your business endeavors.  Whether it's a small or large enterprise, SAP's SME software can help in many ways. ", "review_date": "Monday, January 14, 2013", "review_name": "Ryan"}], "more_info": [{"company_url": "www.sap.com", "more_info_text": "More Information"}]}