{"collection_name": "company_specific", "root_data": [{"object_name": "detail", "data": [{"company_name": "Xero", "sub_data": [{"object_name": "about", "data": [{"about_content": "Xero is a global company with offices in the United States, United Kingdom, Australia and New Zealand and customers all over the world. Our mission is to materially improve GDP globally by making small businesses more productive.\rXero was founded in July 2006, is one of the top 20 companies on the New Zealand Stock Exchange and is listed on the Australian Securities Exchange. We are a new type of multinational with teams around the world united in our passion to revolutionise small business.\r As the emerging leader in online accounting software, we connect small businesses to their advisors and a myriad of other connected services. Xero provides business owners with real-time visibility of their financial position in a way that’s simple, smart and secure. For advisors such as accountants and bookkeepers, Xero forges a trusted relationship with clients through online collaboration and gives them the opportunity to extend their services.\r We’re thrilled with the impact we’re making globally. We have so many customers telling us that we’re removing many aspects of running a business that are hard, boring or frustrating. We’re often told we’ve made accounting fun! That delights us as we love technology and making business better.", "about_heading": "About Xero"}]}, {"object_name": "key_feature", "data": [{"key_feature_value": ["Fast bank reconcilication", "Unlimited users, for free", "Smart reports", "Go mobile", "Easy invoicing", "Pay bills"]}]}]}]}, {"object_name": "services", "data": [{"service_name": ["Accounting Software"], "service_info_text": "Services"}]}, {"object_name": "more_info", "data": [{"company_url": "www.xero.com", "more_info_text": "More Information"}]}, {"object_name": "review", "data": [{"review_comment": "Very good for managing a small business, I am able to manage my finances much more efficiently  than without Xero.  I would recommend to anyone. ", "review_date": "Friday, February 28, 2014", "review_name": "Alexander"}, {"review_comment": "Xero has been absolutely fantastic at helping me managing my small business. I have had much more time to be customer oriented, and this product has been a huge part of my success!", "review_date": "Monday, February 10, 2014", "review_name": "Domenic"}, {"review_comment": "Xero is absolutely wonderful for organizing my finances for my job.  It helped me with the P&L; as well as the cash flow.  ", "review_date": "Friday, January 3, 2014", "review_name": "Rich"}, {"review_comment": "Xero's accounting software helps run the business effectively. The small business owners find it user friendly and very effective for accounting transactions.", "review_date": "Monday, December 16, 2013", "review_name": "Sangeetha"}, {"review_comment": "Xero is the perfect accounting program for small business owners! It allows you to actually see your cash flow as it's happening, and of course allows you to create invoices and import/code your bank transactions. Really loving this program!", "review_date": "Friday, November 22, 2013", "review_name": "Jacqueline"}, {"review_comment": "Xero is a phenomenal program for anyone looking to get their finances in order. The software is extremely easy to use and very effective.", "review_date": "Wednesday, November 13, 2013", "review_name": "James"}, {"review_comment": "Sensational! this online accounting has made my life so much easier already  after only a month! The changeover from my other accounting software was  simple enough for me to figure out on my owner, and the import process was accurate and easy. The importing of online statements makes the process so easy and removes the human error of manual data entry. Safe to say, I Love this product!", "review_date": "Friday, September 27, 2013", "review_name": "Michelle Williams"}, {"review_comment": "Just got the Xero for dummies book. Love it, it has reassured me what I am doing is correct and after reading only a couple of chapters I can navigate my way round the dashboard etc much quicker. Thank you for another great help tool.", "review_date": "Wednesday, September 25, 2013", "review_name": "Cazza"}, {"review_comment": "I'm a small business owner and XERO is great simple easy to use set up and track all my accounts, if I need help its there and I can give access to my advisers. And its affordable that's a bonus!!", "review_date": "Wednesday, September 18, 2013", "review_name": "Sue Hope"}, {"review_comment": "Streamlines the payment process. Tells me when a customer has seen a sent invoice form.  Payment is efficient and makes the online payment process easy both for the business and the consumer. I didn't like not being able to add attachments to the invoices, but other than that it has served my basic needs well. ", "review_date": "Tuesday, August 20, 2013", "review_name": "Chris"}, {"review_comment": " I was searching for a way to keep all of my books and accounting details up to date and after careful research, I decided Xero was the way to go.  I am glad I chose Xero because I was able to finally do my own taxes and accounting without having to hire a CPA.  As a result, I was able to cut expenses and ended up with a large tax return.  I am now a customer for life.", "review_date": "Monday, August 19, 2013", "review_name": "Ben Foster"}, {"review_comment": "Easy to use and covers all my bases. Xero lets me track everything I need to keep track of in my business without being needlessly complex. Definitely give this one a free try!", "review_date": "Friday, August 9, 2013", "review_name": "Lee Greenwood"}, {"review_comment": "Xero is really a revolution in accounting systems and makes doing accounting ten times easy than traditional offline systems.", "review_date": "Wednesday, July 17, 2013", "review_name": "Louis Friel"}, {"review_comment": "Xero offers the best accounting system for use by many ICT start-up companies as it is efficient, effective and very adoptable. I highly recommend it to many first time investors.", "review_date": "Wednesday, July 10, 2013", "review_name": "William"}, {"review_comment": "As an older person (over 50 and proud!!) who has used many accounting systems over my many years of employment, I can honestly say I am very impressed with Xero. We changed over at work and I was so impressed have now registered for my own small business as well. It works like magic!", "review_date": "Friday, July 5, 2013", "review_name": "Christina Monk"}, {"review_comment": "Xero takes a little getting used to than the other accounting software I was using and have found that it provides a lot more information.", "review_date": "Tuesday, July 2, 2013", "review_name": "Crystall"}, {"review_comment": "Xero is an accounting idiots' dream. This software is great and extremely simple to use. I would advise any and everyone who needs a good financial tool to try this.  ", "review_date": "Wednesday, May 29, 2013", "review_name": "Greg W."}, {"review_comment": "Xero accounting software is incredible! The interface is so straight forward and easy to manage accounts, and has saved me so much time! ", "review_date": "Tuesday, April 16, 2013", "review_name": "robert"}, {"review_comment": "Honestly Xero software is one of the best products out there. I would definitely recommend it to anybody, its very simple to manage all your financial needs in this easy to use software.  ", "review_date": "Friday, April 12, 2013", "review_name": "retsnis"}, {"review_comment": "Xero is accounting software made easy. Many people are great at running a business but when it comes to actually doing the financials they have several problems navigating certain accounting software. The best thing to do is find software that fits your needs and that is was Xero does. The software makes it quick and extremely easy to manage your account and do various billings. Xero can also be used anywhere as long as you have your computer, it is definitely the best software out there today for businesses with simple to complex accounting needs.", "review_date": "Wednesday, March 27, 2013", "review_name": "Cassie"}, {"review_comment": "Xero is simply amazing! Everything about it is genius. It is so easy to use. You wont feel like you are doing your accounting. I can honestly say the best thing  about it from switching to Xero a year ago, is the time it has given me back with my 2 small children. I will work anywhere from 6-12 hrs a week on my accounts and the 12 hour week is the billing week. That's all! Our business is classed medium size as well. I can use it anywhere. Go on holiday and still know where im at, pay bills etc. I would be very nervous about changing from them now. There is no better program for us! Change now! Thank you Xero!  ", "review_date": "Tuesday, February 26, 2013", "review_name": "Lucy Enoka"}, {"review_comment": "I've tried a few other products out there and nothing is as easy to use or works nearly as well as Xero! Love it! ", "review_date": "Tuesday, February 12, 2013", "review_name": "Tony B"}, {"review_comment": "I am so happy with this accounting software! I'm not great at accounting and my old software was totally confusing and added unneeded work to an already busy day. But now accounting is a breeze!   ", "review_date": "Monday, January 21, 2013", "review_name": "Shelly"}, {"review_comment": "Owning a small company there are plenty of options when it comes to accounting software. However, we have found Xero to be the best we've used. From the interface to ease of use, Xero has been a win! ", "review_date": "Wednesday, January 16, 2013", "review_name": "Kyle"}, {"review_comment": "I tried another accounting software and ended up confused and frustrated. Then I made the switch to Xero and I couldn't be happier. Xero is incredibly easy to use and very intuitive and has some of the best customer service I have experienced. As they claim it is, Xero is truly beautiful accounting software. Thank you Xero! ", "review_date": "Wednesday, January 9, 2013", "review_name": "Erica"}, {"review_comment": "A spectacular site! The easiest and most organized program I have used to date. ", "review_date": "Wednesday, January 9, 2013", "review_name": "VivEliot"}, {"review_comment": "Great site and a great video too. Site is easy to navigate and get to where you want fast. Great cloud software. ", "review_date": "Monday, January 7, 2013", "review_name": "Jeff"}, {"review_comment": "The site is great, it is easy to view and clearly explains what the company does. However, I wish the images were a bit bigger since there is a great deal of text on the page.  ", "review_date": "Friday, December 28, 2012", "review_name": "Al"}, {"review_comment": "My small business was struggling, we couldn't keep track of our expenses and our invoice system was a joke. I tried other programs and just couldn't figure them out. Xero made it so easy and the explanations were easy to understand. My employees are much happier with their new payroll. ", "review_date": "Friday, December 28, 2012", "review_name": "Kassie"}, {"review_comment": "Xero is a phenomenal platform that has dramatically impacted how we serve our clients. Xero is incredibly user friendly, intuitive and collaborative. With Xero we know we can truly serve clients anywhere, anytime and become their trusted advisor. ", "review_date": "Thursday, December 27, 2012", "review_name": "Rickey Sanchez"}, {"review_comment": "We tried so many other online accounting systems for our small business and none of them fitted the bill. The free ones were light on functions that you actually need. Xero was right on. It's not super simple, but once you get the hang of it, it's very quick and powerful. The support team is great and very responsive.", "review_date": "Thursday, December 27, 2012", "review_name": "Tal Ziv"}, {"review_comment": "A very comprehensive service that helps with all aspects of business usage. Great to have all the accounting and evaluation pieces in one place with Xero.", "review_date": "Thursday, December 27, 2012", "review_name": "Anne"}, {"review_comment": "I find Xero to be not only an innovative service but also so easy to use! I love the easy set up, the bright colors and the assistance that can be found if help is needed with any aspect of it! ", "review_date": "Tuesday, December 18, 2012", "review_name": "JGJUNE"}, {"review_comment": "Xero has been a great asset to my business. Easy to use and reasonably priced. It's a purchase I would definitely make again. Thanks Xero! ", "review_date": "Monday, December 17, 2012", "review_name": "Kimberloo"}, {"review_comment": "I discovered Xero after having a bad experience with another company. Not only is it highly intuitive to use, but the updates to the software happen every few months. If the feature you want is not there now, you can have confidence that it will be there soon. I estimate that I spend 30-50% less time processing transactions, which means more time is available for generating useful management information for my clients. The result is all my clients are now on Xero (and WorkflowMax). Its a no-brainer!", "review_date": "Friday, December 14, 2012", "review_name": "Mark Forbes"}, {"review_comment": "Xero has proved to be an excellent solution to our accounting needs. Following the SaaS model and being accessible from anywhere makes it really easy for us to share our accounts with our accountants. It also removes the reams of paper we used to have to pass around. It is a fully functional platform providing a great suite of tools for managing your financial business on. We especially like the invoicing integration and the bank feeds. It is almost worth signing up for Xero and then choosing your bank as not all banks are equal. One note is their pricing model, depending on how your business is structured you can find that there is only one small aspect of Xero that is relevant. This would mean you need to move higher up their model. Whether it be the number of invoices or multi-currency support you can find your costs increasing due to a need for one small aspect. However, the functionality and support outweigh this quickly.", "review_date": "Wednesday, December 12, 2012", "review_name": "Paul Scott"}, {"review_comment": "This software has saved me and my business time and money.  It is so simple to understand and use. I can access it on the go from my mobile phone or while I am home. Definitely for the small business owner who is concerned with their bottom line.", "review_date": "Monday, December 10, 2012", "review_name": "William S."}, {"review_comment": "This software is simple and easy to use. Even beginners can get up to speed on quickly and it really makes your accounting work more productive.  I would especially recommend it for small business owners and entrepreneurs who have more important things to do than waste their day trying to figure out complicated accounting software.", "review_date": "Thursday, November 29, 2012", "review_name": "Marie"}, {"review_comment": "This software has done wonders. I can now manage all the info I need for my business super easy and super fast. I would recommend this for anyone who has to multitask throughout the day.  ", "review_date": "Wednesday, November 28, 2012", "review_name": "Randy"}, {"review_comment": "This product is great. I operate a small video production company that primarily does weddings and event videography. This program is extremely easy to use and even my wife enjoys using it when usually finances stress her out!", "review_date": "Monday, November 26, 2012", "review_name": "Robert Ryan"}, {"review_comment": "Best of breed software at it's best. Another star for creating an environment for integration. It comes full circle with add-ons like Vend Point-of-Sale, Flexitime Payroll, Capsule CRM (a few of my favourites) and many more fantastic applications. Or your own API. Affordable, easy to use, what a great tool for small business!", "review_date": "Friday, June 8, 2012", "review_name": "Anja O'Connor"}, {"review_comment": "Get off Quickbooks and myob now! This is a life changer. It literally puts a smile on your face (even when doing book work). I have been using this for 2 years now... problems, upgrade issues, glitches = none! ", "review_date": "Thursday, June 7, 2012", "review_name": "Martin Crozier"}, {"review_comment": "Xero is a great product backed by fantastic customer service .  I have no difficulty recommending it to my clients. It is truly the future of accounting software!  ", "review_date": "Tuesday, June 5, 2012", "review_name": "S Allotey"}, {"review_comment": "Xero is one of the best accounting/bookkeeping tools available in Australia.It allows for increased efficiency, productivity and more importantly, enjoyment.It's easy to use, easy to demonstrate and a lot of fun. The staff are always friendly and pleasant to deal with. They enjoy what they do and that helps us be more confident and comfortable to sell and use the product.", "review_date": "Monday, June 4, 2012", "review_name": "Melissa North"}, {"review_comment": "As you can tell with 5 stars all round I am a real fan of Xero. Since early 2008 it has completely changed the relationship I have with 'that side' of my business.As a Mac and PC user who is often out of the office (developing and delivering a business renovation challenge that boosts established Kiwi businesses NZ-wide), and being very committed to providing a good experience for my clients (right through to correct and timely invoicing),  Xero has made a big difference. I am now happy to spend time on 'that side' because the time required is so much shorter - the system is very visual, uncluttered and smart. Xero almost makes 'doing the books' fun and it certainly contributes to peace of mind.", "review_date": "Monday, June 4, 2012", "review_name": "Jacqui Jones"}, {"review_comment": "We have used Xero since 2007 - for two companies and an investment trust. It is one of the best, if not the best, SaaS app that we have used in our businesses. If you're not using Xero for your accounting software, give it a try. It is addictively awesome.", "review_date": "Monday, June 4, 2012", "review_name": "Ryan Baker"}]}]}